function validSudoku(board) {
  // Создаем множество
  seen = new Set();
  for (let i = 0; i < 9; i++) {
    for (let k = 0; k < 9; k++) {
      // Перебираем всё поле
      // i - строка
      // k = цифра в строке
      const num = board[i][k];
      //   Точки не учитываем
      if (num != ".") {
        // Пишем коорды каждой цифры
        const rowKey = `${num} в строке ${i}`;
        const columnKey = `${num} в столбце ${k}`;
        const square = Math.floor(i / 3) * 3 + Math.floor(k / 3);
        const squareKey = `${num} в квадрате ${square}`;
        // Если есть повторы
        if (seen.has(rowKey) || seen.has(columnKey) || seen.has(squareKey)) {
          return false;
        }
        // Добавляем в множество
        seen.add(rowKey);
        seen.add(columnKey);
        seen.add(squareKey);
      }
    }
  }
  return true;
}

console.log(
  validSudoku([
    ["5", "3", ".", ".", "7", ".", ".", ".", "."],
    ["6", ".", ".", "1", "9", "5", ".", ".", "."],
    [".", "9", "8", ".", ".", ".", ".", "6", "."],
    ["8", ".", ".", ".", "6", ".", ".", ".", "3"],
    ["4", ".", ".", "8", ".", "3", ".", ".", "1"],
    ["7", ".", ".", ".", "2", ".", ".", ".", "6"],
    [".", "6", ".", ".", ".", ".", "2", "8", "."],
    [".", ".", ".", "4", "1", "9", ".", ".", "5"],
    [".", ".", ".", ".", "8", ".", ".", "7", "9"],
  ])
); // true

console.log(
  validSudoku([
    ["8", "3", ".", ".", "7", ".", ".", ".", "."],
    ["6", ".", ".", "1", "9", "5", ".", ".", "."],
    [".", "9", "8", ".", ".", ".", ".", "6", "."],
    ["8", ".", ".", ".", "6", ".", ".", ".", "3"],
    ["4", ".", ".", "8", ".", "3", ".", ".", "1"],
    ["7", ".", ".", ".", "2", ".", ".", ".", "6"],
    [".", "6", ".", ".", ".", ".", "2", "8", "."],
    [".", ".", ".", "4", "1", "9", ".", ".", "5"],
    [".", ".", ".", ".", "8", ".", ".", "7", "9"],
  ])
); // false
